jcfain/TCodeESP32/ESP32/src/main.cpp
/* MIT License

Copyright (c) 2024 Jason C. Fain

Permission is hereby granted, free of charge, to any person obtaining a copy
of this software and associated documentation files (the "Software"), to deal
in the Software without restriction, including without limitation the rights
to use, copy, modify, merge, publish, distribute, sublicense, and/or sell
copies of the Software, and to permit persons to whom the Software is
furnished to do so, subject to the following conditions:

The above copyright notice and this permission notice shall be included in all
copies or substantial portions of the Software.

THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR
IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY,
FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE
AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER
LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM,
OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE
SOFTWARE. */

#include "esp_idf_version.h"
#if ESP_IDF_VERSION >= ESP_IDF_VERSION_VAL(5, 0, 0)
#define ESP_ARDUINO3
#endif
#if DEBUG_BUILD
#define LOG_LOCAL_LEVEL ESP_LOG_VERBOSE
#include "esp_log.h"
#endif
#include <Arduino.h>

#if PICO_BUILD
// #include <FreeRTOS.h>
#endif

#if ESP8266 == 1
#include <ESP8266WiFi.h>
#include <ESP8266mDNS.h>
#include <ESP8266HTTPClient.h>
#include <ESP8266HTTPUpdateServer.h>
#include <ESP8266WebServer.h>
#endif

#include "utils.h"
#include <LittleFS.h>
#include <TCode.h>
#include "logging/LogHandler.h"
#include "SettingsHandler.h"
#include "SystemCommandHandler.h"
#if WIFI_TCODE
#include "WifiHandler.h"
#endif

#if BUILD_TEMP
#include "TemperatureHandler.h"
#endif
#if BUILD_DISPLAY
#include "DisplayHandler.h"
#endif
#if BLUETOOTH_TCODE
#include "BluetoothHandler.h"
#endif
#include "TCode/MotorHandler.h"
// #include "BLEConfigurationHandler.h"

#if MOTOR_TYPE == 0
#include "TCode/v0.3/ServoHandler0_3.h"
#include "TCode/v0.4/ServoHandler0_4.h"
#elif MOTOR_TYPE == 1
#include "TCode/v0.3/BLDCHandler0_3.h"
#include "TCode/v0.4/BLDCHandler0_4.h"
#endif

#if WIFI_TCODE
#include "UdpHandler2.h"
// #include "TcpHandler.h"
#include "HTTP/HTTPBase.h"
#include "HTTP/WebSocketBase.h"
#if !SECURE_WEB
#include "WebHandler.h"
//#include "WebHandler_psychic.h"
#else
#include "HTTP\HTTPSHandler.hpp"
#endif
#include "MDNSHandler.hpp"
#endif
// #include "OTAHandler.h"
#if BLE_TCODE
#include "BLE/BLEHandler.hpp"
#endif

#if WIFI_TCODE
#if !SECURE_WEB
#include "WebSocketHandler.h"
//#include "WebSocketHandler_psychic.h"
#else
#include "HTTP/SecureWebSocketHandler.hpp"
#endif
#endif

#include "BatteryHandler.h"
#include "Motion/MotionHandler.hpp"
#include "VoiceHandler.hpp"
#include "ButtonHandler.hpp"

TickType_t pxPreviousWakeTime = millis();
SystemCommandHandler *systemCommandHandler;
SettingsFactory *settingsFactory;
// BLEConfigurationHandler* bleConfigurationHandler;
// TcpHandler tcpHandler;
MotorHandler *motorHandler;
BatteryHandler *batteryHandler;
TaskHandle_t batteryTask;
TaskHandle_t httpsTask;

MotionHandler motionHandler;
VoiceHandler *voiceHandler;
ButtonHandler *buttonHandler = 0;
TaskHandle_t voiceTask;
#if BLUETOOTH_TCODE
BluetoothHandler *btHandler = 0;
#endif

#if WIFI_TCODE
Udphandler *udpHandler = 0;
WifiHandler wifi;
MDNSHandler mdnsHandler;
HTTPBase *webHandler = 0;
WebSocketBase *webSocketHandler = 0;
#endif

#if BUILD_TEMP
TemperatureHandler *temperatureHandler = 0;
#endif

#if BLE_TCODE
BLEHandler *bleHandler = 0;
#endif

#if BUILD_DISPLAY
DisplayHandler *displayHandler;
TaskHandle_t displayTask;
// #if ISAAC_NEWTONGUE_BUILD
// 	TaskHandle_t animationTask;
// #endif
#endif
#if BUILD_TEMP
TaskHandle_t temperatureTask;
#endif
// This has issues running with the webserver.
// OTAHandler otaHandler;
bool setupSucceeded = false;
bool restarting = false;

String serialData;
char commandTCodeData[MAX_COMMAND];
char udpData[MAX_COMMAND];
char webSocketData[MAX_COMMAND];
#if BLE_TCODE
char bleData[MAX_COMMAND];
#endif
#if BLUETOOTH_TCODE
String bluetoothData;
#endif
char movement[MAX_COMMAND];
ButtonModel *buttonCommand = 0;
bool dStopped = false;
bool tcodeV2Recieved = false;
bool bluetoothEnabled = BLUETOOTH_ENABLED_DEFAULT;
bool bleEnabled = BLE_ENABLED_DEFAULT;

unsigned long bench[10];
unsigned long benchLast[10];
bool benchEnable = false;
bool benchEnableZero = false;
unsigned long benchThreshHold = 1300;

void benchStart(int benchNumber)
{
	if (benchEnable || (benchEnableZero && benchNumber == 0))
		bench[benchNumber] = micros();
}
void benchFinish(const char *systemUnderBench, int benchNumber)
{
	if (benchEnable || (benchEnableZero && benchNumber == 0))
	{
		unsigned long timeTaken = micros() - bench[benchNumber];
		if (timeTaken > benchThreshHold)
		{
			Serial.printf("%s:							%lu\n", systemUnderBench, timeTaken);
			bench[benchNumber] = 0;
			benchLast[benchNumber] = timeTaken;
		}
	}
}

void displayPrint(String text)
{
#if BUILD_DISPLAY
	displayHandler->println(text);
#endif
}

void TCodeCommandCallback(const char *in)
{

	if (systemCommandHandler->isCommand(in))
	{
		systemCommandHandler->process(in);
	}
	else
	{
#if BLUETOOTH_TCODE
		if (btHandler && btHandler->isConnected())
			btHandler->CommandCallback(in);
#endif
#if BLE_TCODE
		if (bleHandler && bleHandler->isConnected())
			bleHandler->CommandCallback(in);
#endif
#if WIFI_TCODE
		if (webSocketHandler)
			webSocketHandler->CommandCallback(in);
		if (udpHandler)
			udpHandler->CommandCallback(in);
#endif
		if (Serial)
			Serial.println(in);
	}
}
void TCodePassthroughCommandCallback(const char *in)
{
	if (systemCommandHandler->isCommand(in))
	{
		// This seems wrong but since we are only calling this from one place its fine for now.
		char temp[strlen(in) + 2];
		temp[0] = {0};
		strcpy(temp, in);
		strcat(temp, "\n");
//////////////////////////////////////////////////////////////////////////////////////
#if BLUETOOTH_TCODE
		if (btHandler && btHandler->isConnected())
			btHandler->CommandCallback(temp);
#endif
#if BLE_TCODE

#endif
#if WIFI_TCODE
		if (webSocketHandler)
			webSocketHandler->CommandCallback(temp);
		if (udpHandler)
			udpHandler->CommandCallback(temp);
#endif
		if (Serial)
			Serial.println(temp);
	}
}
void profileChangeCallback(uint8_t profile)
{
}
void logCallBack(const char *input, size_t length, LogLevel level)
{
#if WIFI_TCODE
	// if(webSocketHandler) {
	// 	webSocketHandler->sendDebug(in, level);
	// }
#endif
}
#if BUILD_TEMP
void tempChangeCallBack(TemperatureType type, const char *message, float temp)
{
#if WIFI_TCODE
	if (webSocketHandler)
	{
		if (strpbrk(message, "{") == nullptr)
		{
			webSocketHandler->sendCommand(message);
		}
		else
		{
			if (type == TemperatureType::SLEEVE)
			{
				webSocketHandler->sendCommand("sleeveTempStatus", message);
			}
			else
			{
				webSocketHandler->sendCommand("internalTempStatus", message);
			}
		}
	}
#endif
#if BUILD_DISPLAY
	if (displayHandler)
	{
		if (type == TemperatureType::SLEEVE)
		{
			displayHandler->setSleeveTemp(temp);
		}
		else
		{
			displayHandler->setInternalTemp(temp);
		}
	}
#endif
}
void tempStateChangeCallBack(TemperatureType type, const char *state)
{
#if BUILD_DISPLAY
	if (displayHandler)
	{
		if (type == TemperatureType::SLEEVE)
		{
			LogHandler::verbose(TagHandler::Main, "tempStateChangeCallBack heat: %s", state);
			displayHandler->setHeateState(state);
			if (temperatureHandler)
				displayHandler->setHeateStateShort(temperatureHandler->getShortSleeveControlStatus(state));
		}
		else
		{
			LogHandler::verbose(TagHandler::Main, "tempStateChangeCallBack fan: %s", state);
			displayHandler->setFanState(state);
		}
	}
#endif
}
#endif
#if WIFI_TCODE
void startNetworking(const bool &apMode, const int &port, const int &udpPort, const char *hostname, const char *friendlyName)
{
	if((MODULE_CURRENT != ModuleType::WROOM32 || (!bluetoothEnabled && !bleEnabled)) && !webHandler) 
	{
		displayPrint("Starting web server");
	#if !SECURE_WEB
		webHandler = new WebHandler();
		webSocketHandler = new WebSocketHandler();
	#else
		LogHandler::debug(TagHandler::Main, "Start https task");
		webHandler = new HTTPSHandler();
		webSocketHandler = new SecureWebSocketHandler();
		auto httpsStatus = xTaskCreateUniversal(
			HTTPSHandler::startLoop, /* Function to implement the task */
			"HTTPSTask",			 /* Name of the task */
			8192 * 3,				 /* Stack size in words */
			webHandler,				 /* Task input parameter */
			3,						 /* Priority of the task */
			&httpsTask,				 /* Task handle. */
			-1);					 /* Core where the task should run */
		if (httpsStatus != pdPASS)
		{
			LogHandler::error(TagHandler::Main, "Could not start https task.");
		}
	#endif
		webHandler->setup(port, webSocketHandler, apMode);
    	LogHandler::debug(TagHandler::Main, "Web DRAM heaps free %u\n", heap_caps_get_free_size(MALLOC_CAP_8BIT));
	} else {
		displayPrint("WebServer disabled");
		LogHandler::info(TagHandler::Main, "WebServer disabled due to bluetooth and chip model");
	}
	if (!apMode) {// mdns breaks apmode?
		mdnsHandler.setup(hostname, friendlyName, port, udpPort);
    	LogHandler::debug(TagHandler::Main, "MDNS DRAM heaps free %u\n", heap_caps_get_free_size(MALLOC_CAP_8BIT));
	}
}
#endif

void startBLEConfig()
{
	// Disabled. Android Application needs maintenance
	// if(!bleConfigurationHandler) {
	// 	displayPrint("Starting BLE config");
	// 	bleConfigurationHandler = new BLEConfigurationHandler();
	// 	bleConfigurationHandler->setup();
	// }
}

#if BLE_TCODE
void startBLETCode()
{
	if (!bleHandler)
	{
		displayPrint("Starting BLE");
		bleHandler = new BLEHandler();
		bleHandler->setup();
	}
}
#endif

