jcfain/TCodeESP32/ESP32/src/main.cpp
#if BLUETOOTH_TCODE
void startBlueTooth()
{
	if (bluetoothEnabled && !btHandler)
	{
		displayPrint("Starting Bluetooth serial");
		btHandler = new BluetoothHandler();
		btHandler->setup();
	}
}
#endif

#if WIFI_TCODE
bool startUDPTCode(int port)
{
	if (!udpHandler)
	{
		displayPrint("Starting UDP");
		udpHandler = new Udphandler();
		if (!udpHandler->setup(port))
			return false;
	}
	return true;
}
#endif

void startConfigMode(const int &webPort, const int &udpPort, const char *hostname, const char *friendlyName)
{
#if WIFI_TCODE
	SettingsHandler::apMode = true;
	LogHandler::info(TagHandler::Main, "Starting in APMode");
	displayPrint("Starting in APMode");
	if (wifi.startAp())
	{
		LogHandler::info(TagHandler::Main, "APMode started");
		displayPrint("APMode started");
		startNetworking(SettingsHandler::apMode, webPort, udpPort, hostname, friendlyName);
	}
	else
	{
		LogHandler::error(TagHandler::Main, "APMode start failed");
		displayPrint("APMode start failed");
	}
#endif

#if BLE_TCODE || BLUETOOTH_TCODE
	if(bleEnabled || bluetoothEnabled) {
		startBLEConfig();
	}
#endif
}

#if WIFI_TCODE
void wifiStatusCallBack(WiFiStatus status, WiFiReason reason)
{
	if (status == WiFiStatus::CONNECTED)
	{
		LogHandler::debug(TagHandler::Main, "wifiStatusCallBack WiFiStatus::CONNECTED");
		if (reason == WiFiReason::AP_MODE)
		{
			LogHandler::debug(TagHandler::Main, "wifiStatusCallBack WiFiReason::AP_MODE");
			// if(bleConfigurationHandler)
			//   bleConfigurationHandler->stop(); // If a client connects to the ap stop the BLE to save memory.
		}
	}
	else
	{
		// wifi.dispose();
		// startApMode();
		LogHandler::debug(TagHandler::Main, "wifiStatusCallBack Not connected");
		if (reason == WiFiReason::NO_AP || reason == WiFiReason::UNKNOWN)
		{
			LogHandler::debug(TagHandler::Main, "wifiStatusCallBack WiFiReason::NO_AP || WiFiReason::UNKNOWN");
			startConfigMode(
				settingsFactory->getWebServerPort(),
				settingsFactory->getUdpServerPort(),
				settingsFactory->getHostname(),
				settingsFactory->getFriendlyName());
		}
		else if (reason == WiFiReason::AUTH)
		{
			LogHandler::debug(TagHandler::Main, "wifiStatusCallBack WiFiReason::AUTH");
			LogHandler::warning(TagHandler::Main, "Connection auth failed: Resetting wifi password and restarting");
			settingsFactory->defaultValue(WIFI_PASS_SETTING);
			ESP.restart();
		}
		else if (reason == WiFiReason::AP_MODE)
		{
			LogHandler::debug(TagHandler::Main, "wifiStatusCallBack WiFiReason::AP_MODE");
			// #ifdef !ESP32_DA
			// if(bleConfigurationHandler)
			// 	bleConfigurationHandler->setup();
			// #endif
		}
	}
}
#endif

void batteryVoltageCallback(float capacityRemainingPercentage, float capacityRemaining, float voltage, float temperature)
{
#if BUILD_DISPLAY
	if (displayHandler)
	{
		displayHandler->setBatteryInformation(capacityRemainingPercentage, voltage, temperature);
	}
#endif
#if WIFI_TCODE
	if (webSocketHandler)
	{
		String statusJson("{\"batteryCapacityRemaining\":\"" + String(capacityRemaining) + "\", \"batteryCapacityRemainingPercentage\":\"" + String(capacityRemainingPercentage) + "\", \"batteryVoltage\":\"" + String(voltage) + "\", \"batteryTemperature\":\"" + String(temperature) + "\"}");
		webSocketHandler->sendCommand("batteryStatus", statusJson.c_str());
	}
#endif
}

void settingChangeCallback(const SettingProfile &profile, const char *settingThatChanged)
{
	LogHandler::verbose(TagHandler::Main, "settingChangeCallback: %s", settingThatChanged);
	if (profile == SettingProfile::System)
	{
		if (!strcmp(settingThatChanged, LOG_LEVEL_SETTING))
		{
			LogHandler::setLogLevel(settingsFactory->getLogLevel());
		}
		else if (!strcmp(settingThatChanged, LOG_INCLUDETAGS))
		{
			LogHandler::setIncludes(settingsFactory->getLogIncludes());
		}
		else if (!strcmp(settingThatChanged, LOG_EXCLUDETAGS))
		{
			LogHandler::setExcludes(settingsFactory->getLogExcludes());
		}
	}
	else if (profile == SettingProfile::MotionProfile)
	{
		if (strcmp(settingThatChanged, MOTION_PROFILE_SELECTED_INDEX) == 0 || strcmp(settingThatChanged, MOTION_PROFILES) == 0) {
			motionHandler.setMotionChannels(SettingsHandler::getMotionChannels());
		//} else if(strcmp(settingThatChanged, "motionChannels") == 0) {
		// 	motionHandler.setMotionChannels(SettingsHandler::getGetMotionChannels()());
		} else if (strcmp(settingThatChanged, MOTION_ENABLED) == 0) {
			LogHandler::verbose(TagHandler::Main, "MOTION_ENABLED: %d", SettingsHandler::getMotionEnabled());
			motionHandler.setEnabled(SettingsHandler::getMotionEnabled());
		}
		// else if(strcmp(settingThatChanged, "motionAmplitudeGlobal") == 0)
		// 	motionHandler.setAmplitude(SettingsHandler::getGetMotionAmplitudeGlobal()());
		// else if(strcmp(settingThatChanged, "motionOffsetGlobal") == 0)
		// 	motionHandler.setOffset(SettingsHandler::getGetMotionOffsetGlobal()());
		// else if(strcmp(settingThatChanged, "motionPeriodGlobal") == 0)
		// 	motionHandler.setPeriod(SettingsHandler::getGetMotionPeriodGlobal()());
		// else if(strcmp(settingThatChanged, "motionUpdateGlobal") == 0)
		// 	motionHandler.setUpdate(SettingsHandler::getGetMotionUpdateGlobal()());
		// else if(strcmp(settingThatChanged, "motionPhaseGlobal") == 0)
		// 	motionHandler.setPhase(SettingsHandler::getGetMotionPhaseGlobal()());
		// else if(strcmp(settingThatChanged, "motionReversedGlobal") == 0)
		// 	motionHandler.setReverse(SettingsHandler::getGetMotionReversedGlobal()());
		// else if(strcmp(settingThatChanged, "motionAmplitudeGlobalRandom") == 0)
		// 	motionHandler.setAmplitudeRandom(SettingsHandler::getGetMotionAmplitudeGlobalRandom()());
		// else if(strcmp(settingThatChanged, "motionAmplitudeGlobalRandomMin") == 0)
		// 	motionHandler.setAmplitudeRandomMin(SettingsHandler::getGetMotionAmplitudeGlobalRandomMin()());
		// else if(strcmp(settingThatChanged, "motionAmplitudeGlobalRandomMax") == 0)
		// 	motionHandler.setAmplitudeRandomMax(SettingsHandler::getGetMotionAmplitudeGlobalRandomMax()());
		// else if(strcmp(settingThatChanged, "motionPeriodGlobalRandom") == 0)
		// 	motionHandler.setPeriodRandom(SettingsHandler::getGetMotionPeriodGlobalRandom()());
		// else if(strcmp(settingThatChanged, "motionPeriodGlobalRandomMin") == 0)
		// 	motionHandler.setPeriodRandomMin(SettingsHandler::getGetMotionPeriodGlobalRandomMin()());
		// else if(strcmp(settingThatChanged, "motionPeriodGlobalRandomMax") == 0)
		// 	motionHandler.setPeriodRandomMax(SettingsHandler::getGetMotionPeriodGlobalRandomMax()());
		// else if(strcmp(settingThatChanged, "motionOffsetGlobalRandom") == 0)
		// 	motionHandler.setOffsetRandom(SettingsHandler::getGetMotionOffsetGlobalRandom()());
		// else if(strcmp(settingThatChanged, "motionOffsetGlobalRandomMin") == 0)
		// 	motionHandler.setOffsetRandomMin(SettingsHandler::getGetMotionOffsetGlobalRandomMin()());
		// else if(strcmp(settingThatChanged, "motionOffsetGlobalRandomMax") == 0)
		// 	motionHandler.setOffsetRandomMax(SettingsHandler::getGetMotionOffsetGlobalRandomMax()());
		// else if(strcmp(settingThatChanged, "motionRandomChangeMin") == 0)
		// 	motionHandler.setMotionRandomChangeMin(SettingsHandler::getGetMotionRandomChangeMin()());
		// else if(strcmp(settingThatChanged, "motionRandomChangeMax") == 0)
		// 	motionHandler.setMotionRandomChangeMax(SettingsHandler::getGetMotionRandomChangeMax()());
	}
	else if (voiceHandler && profile == SettingProfile::Voice)
	{
		if (strcmp(settingThatChanged, "voiceMuted") == 0)
		{
			voiceHandler->setMuteMode(settingsFactory->getVoiceMuted());
		}
		else if (strcmp(settingThatChanged, "voiceVolume") == 0)
		{
			voiceHandler->setVolume(settingsFactory->getVoiceVolume());
		}
		else if (strcmp(settingThatChanged, "voiceWakeTime") == 0)
		{
			voiceHandler->setWakeTime(settingsFactory->getVoiceWakeTime());
		}
	}
	else if (buttonHandler && profile == SettingProfile::Button)
	{
		if (strcmp(settingThatChanged, "bootButtonCommand") == 0)
			buttonHandler->updateBootButtonCommand(settingsFactory->getBootButtonCommand());
		else if (strcmp(settingThatChanged, "analogButtonCommands") == 0)
		{
			buttonHandler->updateAnalogButtonCommands(SettingsHandler::getButtonSets());
		}
		else if (strcmp(settingThatChanged, "buttonAnalogDebounce") == 0)
		{
			buttonHandler->updateAnalogDebounce(settingsFactory->getButtonAnalogDebounce());
		}
	}
	else if (profile == SettingProfile::ChannelRanges)
	{ // TODO add channe; specific updates when moving to its own save...maybe...
		motionHandler.updateChannelRanges();
	}
}
void loadI2CModules(bool displayEnabled, bool batteryEnabled, bool voiceEnabled)
{
#if BUILD_DISPLAY
	if (displayEnabled)
	{
		LogHandler::debug(TagHandler::Main, "Start Display task");
		auto displayStatus = xTaskCreatePinnedToCore(
			DisplayHandler::startLoop,	  /* Function to implement the task */
			"DisplayTask",				  /* Name of the task */
			configMINIMAL_STACK_SIZE * 4, /* Stack size in words used to be 5000 */
			displayHandler,				  /* Task input parameter */
			1,							  /* Priority of the task */
			&displayTask,				  /* Task handle. */
			APP_CPU_NUM);				  /* Core where the task should run */
		if (displayStatus != pdPASS)
		{
			LogHandler::error(TagHandler::Main, "Could not start display task.");
		}
	}
#endif
	if (batteryEnabled)
	{
		batteryHandler = new BatteryHandler();
		if (batteryHandler->setup())
		{
			LogHandler::debug(TagHandler::Main, "Start Battery task");
			auto batteryStatus = xTaskCreatePinnedToCore(
				BatteryHandler::startLoop, /* Function to implement the task */
				"BatteryTask",			   /* Name of the task */
				configMINIMAL_STACK_SIZE,  /* Stack size in words used to be 4028 */
				batteryHandler,			   /* Task input parameter */
				1,						   /* Priority of the task */
				&batteryTask,			   /* Task handle. */
				APP_CPU_NUM);			   /* Core where the task should run */
			if (batteryStatus != pdPASS)
			{
				LogHandler::error(TagHandler::Main, "Could not start battery task.");
			}
			batteryHandler->setMessageCallback(batteryVoltageCallback);
		}
	}
	if (voiceEnabled)
	{
		voiceHandler = new VoiceHandler();
		voiceHandler->setMessageCallback(TCodeCommandCallback);
		if (voiceHandler->setup())
		{
			LogHandler::debug(TagHandler::Main, "Start Voice task");
			auto voiceStatus = xTaskCreatePinnedToCore(
				VoiceHandler::startLoop,  /* Function to implement the task */
				"VoiceTask",			  /* Name of the task */
				configMINIMAL_STACK_SIZE, /* Stack size in words used to be 4028 */
				voiceHandler,			  /* Task input parameter */
				1,						  /* Priority of the task */
				&voiceTask,				  /* Task handle. */
				APP_CPU_NUM);			  /* Core where the task should run */
			if (voiceStatus != pdPASS)
			{
				LogHandler::error(TagHandler::Main, "Could not start voice task.");
			}
		}
	}
}
void setup()
{

	// setCpuFrequencyMhz(240);

