jcfain/TCodeESP32/ESP32/src/main.cpp
	// see if we can use the onboard led for status
	// https://github.com/kriswiner/ESP32/blob/master/PWM/ledcWrite_demo_ESP32.ino
	// digitalWrite(5, LOW);// Turn off on-board blue led

	Serial.begin(115200);
    Serial.printf("Startup DRAM heaps free %u\n", heap_caps_get_free_size(MALLOC_CAP_8BIT));

	LogHandler::setLogLevel(LogLevel::INFO);
	LogHandler::setMessageCallback(logCallBack);

	Serial.println();
	LogHandler::info(TagHandler::Main, "Firmware version: %s", FIRMWARE_VERSION_NAME);
	// LogHandler::info(TagHandler::Main, "Esp arduino version: %s", ESP_ARDUINO_VERSION_STR);
	LogHandler::info(TagHandler::Main, "ESP IDF version: %s", esp_get_idf_version());
	uint32_t chipId = 0;
	for (int i = 0; i < 17; i = i + 8)
	{
		chipId |= ((ESP.getEfuseMac() >> (40 - i)) & 0xff) << i;
	}
	LogHandler::info(TagHandler::Main, "ESP32 Chip model = %s Rev %d", ESP.getChipModel(), ESP.getChipRevision());
	LogHandler::info(TagHandler::Main, "This chip has %d cores", ESP.getChipCores());
	LogHandler::info(TagHandler::Main, "Chip ID: %u", chipId);
	Serial.println();

	// esp_log_level_set("*", ESP_LOG_VERBOSE);
	// LogHandler::debug("main", "this is verbose");
	// LogHandler::debug("main", "this is debug");
	// LogHandler::info("main", "this is info");
	// LogHandler::warning("main", "this is warning");
	// LogHandler::error("main", "this is error");

	if (!LittleFS.begin(true))
	{
		LogHandler::error(TagHandler::Main, "An Error has occurred while mounting LittleFS");
		setupSucceeded = false;
		return;
	}
    LogHandler::debug(TagHandler::Main, "LittleFS DRAM heaps free %u\n", heap_caps_get_free_size(MALLOC_CAP_8BIT));

	// LogHandler::setLogLevel(LogLevel::DEBUG);
	settingsFactory = SettingsFactory::getInstance();
	settingsFactory->setMessageCallback(settingChangeCallback);
	if (!settingsFactory->init())
	{
		LogHandler::error(TagHandler::Main, "Failed to load settings...");
		return;
	}
    LogHandler::debug(TagHandler::Main, "Settings factory  DRAM heaps free %u\n", heap_caps_get_free_size(MALLOC_CAP_8BIT));
	// LogHandler::setLogLevel(LogLevel::DEBUG);

	const PinMap *pinMap = settingsFactory->getPins();

	SettingsHandler::init();
	SettingsHandler::setMessageCallback(settingChangeCallback);
    LogHandler::debug(TagHandler::Main, "Settings handler DRAM heaps free %u\n", heap_caps_get_free_size(MALLOC_CAP_8BIT));

#if BLE_TCODE
	settingsFactory->getValue(BLE_ENABLED, bleEnabled);
	
	//bleEnabled = true;
#endif
#if BLUETOOTH_TCODE
	settingsFactory->getValue(BLUETOOTH_ENABLED, bluetoothEnabled);
	
	//bluetoothEnabled = true;
#endif

#if WIFI_TCODE
	if ((!bluetoothEnabled && !bleEnabled) || COEXIST)
		wifi.setWiFiStatusCallback(wifiStatusCallBack);
#endif

	// Get ConfigurationSettings
	bool fanControlEnabled = FAN_CONTROL_ENABLED_DEFAULT;
	settingsFactory->getValue(FAN_CONTROL_ENABLED, fanControlEnabled);

	// Cached (Requires reboot)
	MotorType motorType;
	BoardType boardType;
	settingsFactory->getValue(MOTOR_TYPE_SETTING, motorType);
	settingsFactory->getValue(BOARD_TYPE_SETTING, boardType);

	int msPerRad;
	bool lubeEnabled;
	bool feedbackTwist;
	bool analogTwist;
	bool bootButtonEnabled;
	bool buttonSetsEnabled;
#if MOTOR_TYPE == 0

#elif MOTOR_TYPE == 1
	bool BLDC_UseHallSensor;

#warning validate
	double BLDC_MotorA_Voltage;
	double BLDC_MotorA_Current;
	bool BLDC_MotorA_ParametersKnown;
	double BLDC_MotorA_ZeroElecAngle;
	int BLDC_Pulley_Circumference;
	int BLDC_StrokeLength;
	int BLDC_RailLength;
	BLDCEncoderType BLDC_EncoderType;

	settingsFactory->getValue(BLDC_MOTORA_VOLTAGE, BLDC_MotorA_Voltage);
	settingsFactory->getValue(BLDC_MOTORA_CURRENT, BLDC_MotorA_Current);
	settingsFactory->getValue(BLDC_MOTORA_PARAMETERSKNOWN, BLDC_MotorA_ParametersKnown);
	settingsFactory->getValue(BLDC_MOTORA_ZEROELECANGLE, BLDC_MotorA_ZeroElecAngle);
	settingsFactory->getValue(BLDC_PULLEY_CIRCUMFERENCE, BLDC_Pulley_Circumference);
	settingsFactory->getValue(BLDC_STROKELENGTH, BLDC_StrokeLength);
	settingsFactory->getValue(BLDC_RAILLENGTH, BLDC_RailLength);
	settingsFactory->getValue(BLDC_ENCODER, BLDC_EncoderType);
#endif


	settingsFactory->getValue(MS_PER_RAD, msPerRad);
	settingsFactory->getValue(FEEDBACK_TWIST, feedbackTwist);
	settingsFactory->getValue(ANALOG_TWIST, analogTwist);
	settingsFactory->getValue(BOOT_BUTTON_ENABLED, bootButtonEnabled);
	settingsFactory->getValue(BUTTON_SETS_ENABLED, buttonSetsEnabled);

	bool batteryLevelEnabled;
	bool voiceEnabled;
	settingsFactory->getValue(BATTERY_LEVEL_ENABLED, batteryLevelEnabled);
	settingsFactory->getValue(VOICE_ENABLED, voiceEnabled);

	bool displayEnabled;
	settingsFactory->getValue(DISPLAY_ENABLED, displayEnabled);
	char Display_I2C_AddressString[DISPLAY_I2C_ADDRESS_LEN] = {0};
	settingsFactory->getValue(DISPLAY_I2C_ADDRESS, Display_I2C_AddressString, DISPLAY_I2C_ADDRESS_LEN);
	int Display_I2C_Address = (int)strtol(Display_I2C_AddressString, NULL, 0);

	systemCommandHandler = new SystemCommandHandler();
	systemCommandHandler->registerExternalCommandCallback(TCodePassthroughCommandCallback);
    LogHandler::debug(TagHandler::Main, "System command handler DRAM heaps free %u\n", heap_caps_get_free_size(MALLOC_CAP_8BIT));

#if MOTOR_TYPE == 0
	if (settingsFactory->getTcodeVersion() == TCodeVersion::v0_3)
	{
		motorHandler = new ServoHandler0_3();
	}
	else if (settingsFactory->getTcodeVersion() == TCodeVersion::v0_4)
	{
		motorHandler = new ServoHandler0_4();
	}
#if !DEBUG_BUILD && TCODE_V2
	// else if(settingsFactory->getTcodeVersion() == TCodeVersion::v0_2)
	// 	motorHandler = new ServoHandler0_2();
#endif
	else
	{
		LogHandler::error(TagHandler::Main, "Invalid TCode version: %ld", settingsFactory->getTcodeVersion());
		return; // TODO: this stops apmode and not what we want
	}
#elif MOTOR_TYPE == 1
	if (settingsFactory->getTcodeVersion() == TCodeVersion::v0_3)
	{
		motorHandler = new BLDCHandler0_3();
	}
	else if (settingsFactory->getTcodeVersion() == TCodeVersion::v0_4)
	{
		motorHandler = new BLDCHandler0_4();
	}
#else
	LogHandler::error(TagHandler::Main, "Invalid motor type defined!");
	return;
#endif

	motorHandler->setMessageCallback(TCodeCommandCallback);
    LogHandler::debug(TagHandler::Main, "Motor handler DRAM heaps free %u\n", heap_caps_get_free_size(MALLOC_CAP_8BIT));
	// SystemCommandHandler::registerOtherCommandCallback(TCodeCommandCallback);

