jcfain/TCodeESP32/ESP32/src/main.cpp
#if BUILD_TEMP
	bool sleeveTempEnabled;
	bool internalTempEnabled;
	int8_t heaterChannel = pinMap->heaterChannel();
	int heaterFrequency = heaterChannel > -1 ? pinMap->getChannelFrequency(pinMap->heaterChannel()) : ESP_TIMER_FREQUENCY_DEFAULT;
	int heaterResolution;
	float heaterThreshold;
	int8_t caseFanChannel = pinMap->caseFanChannel();
	int caseFanFrequency = caseFanChannel > -1 ? pinMap->getChannelFrequency(pinMap->caseFanChannel()) : ESP_TIMER_FREQUENCY_DEFAULT;
	int caseFanResolution;
	settingsFactory->getValue(TEMP_SLEEVE_ENABLED, sleeveTempEnabled);
	settingsFactory->getValue(TEMP_INTERNAL_ENABLED, internalTempEnabled);
	settingsFactory->getValue(HEATER_RESOLUTION, heaterResolution);
	settingsFactory->getValue(HEATER_THRESHOLD, heaterThreshold);
	settingsFactory->getValue(CASE_FAN_RESOLUTION, caseFanResolution);
	if (sleeveTempEnabled || internalTempEnabled)
	{
		temperatureHandler = new TemperatureHandler();
		temperatureHandler->setup(internalTempEnabled,
								  sleeveTempEnabled,
								  pinMap->sleeveTemp(),
								  pinMap->internalTemp(),
								  pinMap->heater(),
								  heaterChannel,
								  pinMap->caseFan(),
								  caseFanChannel,
								  heaterFrequency,
								  heaterResolution,
								  fanControlEnabled,
								  caseFanFrequency,
								  caseFanResolution);
		temperatureHandler->setMessageCallback(tempChangeCallBack);
		temperatureHandler->setStateChangeCallback(tempStateChangeCallBack);
		LogHandler::debug(TagHandler::Main, "Start temperature task");
		auto tempStartStatus = xTaskCreatePinnedToCore(
			TemperatureHandler::startLoop, /* Function to implement the task */
			"TempTask",					   /* Name of the task */
			configMINIMAL_STACK_SIZE * 2,  /* Stack size in words used to be 5000 */
			temperatureHandler,			   /* Task input parameter */
			1,							   /* Priority of the task */
			&temperatureTask,			   /* Task handle. */
			APP_CPU_NUM);				   /* Core where the task should run */
		if (tempStartStatus != pdPASS)
		{
			LogHandler::error(TagHandler::Main, "Could not start temperature task.");
		}
    	LogHandler::debug(TagHandler::Main, "Temp DRAM heaps free %u\n", heap_caps_get_free_size(MALLOC_CAP_8BIT));
	}

#endif
#if BUILD_DISPLAY
	displayHandler = new DisplayHandler();
	if (displayEnabled)
	{
		displayHandler->setup(Display_I2C_Address, fanControlEnabled, pinMap->displayReset());
		// #if ISAAC_NEWTONGUE_BUILD
		// 	xTaskCreatePinnedToCore(
		// 		DisplayHandler::startAnimationDontPanic,/* Function to implement the task */
		// 		"DisplayTask", /* Name of the task */
		// 		10000,  /* Stack size in words */
		// 		displayHandler,  /* Task input parameter */
		// 		25,  /* Priority of the task */
		// 		&animationTask,  /* Task handle. */
		// 		APP_CPU_NUM); /* Core where the task should run */
		// #endif
	}
    LogHandler::debug(TagHandler::Main, "Display DRAM heaps free %u\n", heap_caps_get_free_size(MALLOC_CAP_8BIT));
#endif

#if BLE_TCODE
	if (bleEnabled)
	{
		startBLETCode();
	}
	else
	{
		BLEHandler::disable();
	}
    LogHandler::debug(TagHandler::Main, "BLE DRAM heaps free %u\n", heap_caps_get_free_size(MALLOC_CAP_8BIT));
#else
	esp_bt_controller_mem_release(ESP_BT_MODE_BTDM)
#endif
#if BLUETOOTH_TCODE
	if (bluetoothEnabled)
	{
		startBlueTooth();
	}
	else
	{
		BluetoothHandler::disable();
	}
    LogHandler::debug(TagHandler::Main, "Bluetooth DRAM heaps free %u\n", heap_caps_get_free_size(MALLOC_CAP_8BIT));
#else
    esp_bt_controller_mem_release(ESP_BT_MODE_CLASSIC_BT);
#endif

#if BLE_TCODE || BLUETOOTH_TCODE
	if (WIFI_TCODE && !COEXIST && (bluetoothEnabled || bleEnabled))
	{
		WifiHandler::disable();
    	LogHandler::debug(TagHandler::Main, "Wifi disable DRAM heaps free %u\n", heap_caps_get_free_size(MALLOC_CAP_8BIT));
	}
#endif

#if WIFI_TCODE
	if ((!bluetoothEnabled && !bleEnabled) || COEXIST)
	{
		char ssid[SSID_LEN];
		char wifiPass[WIFI_PASS_LEN];
		bool staticIP;
		char localIP[IP_ADDRESS_LEN];
		char gateway[IP_ADDRESS_LEN];
		char subnet[IP_ADDRESS_LEN];
		char dns1[IP_ADDRESS_LEN];
		char dns2[IP_ADDRESS_LEN];

		settingsFactory->getValue(SSID_SETTING, ssid, SSID_LEN);
		settingsFactory->getValue(WIFI_PASS_SETTING, wifiPass, WIFI_PASS_LEN);
		settingsFactory->getValue(STATICIP, staticIP);
		settingsFactory->getValue(LOCALIP, localIP, IP_ADDRESS_LEN);
		settingsFactory->getValue(GATEWAY, gateway, IP_ADDRESS_LEN);
		settingsFactory->getValue(SUBNET, subnet, IP_ADDRESS_LEN);
		settingsFactory->getValue(DNS1, dns1, IP_ADDRESS_LEN);
		settingsFactory->getValue(DNS2, dns2, IP_ADDRESS_LEN);
		if (strcmp(wifiPass, WIFI_PASS_DONOTCHANGE_DEFAULT) != 0 && strlen(ssid))
		{
			displayPrint("Setting up wifi...");
			LogHandler::info(TagHandler::Main, "Setting up wifi...");
			displayPrint("Connecting to: ");
			LogHandler::info(TagHandler::Main, "Connecting to: %s", ssid);
			displayPrint(ssid);
			if (wifi.connect(ssid, wifiPass))
			{
				String ipaddress = wifi.ip().toString();
				displayPrint("Connected IP: " + ipaddress);
				LogHandler::info(TagHandler::Main, "Connected IP: %s", ipaddress.c_str());
#if BUILD_DISPLAY
				displayHandler->setLocalIPAddress(wifi.ip());
#endif
				if (!startUDPTCode(settingsFactory->getUdpServerPort()))
				{
					LogHandler::error(TagHandler::Main, "Error starting UDP server!");
					return;
				}
    			LogHandler::debug(TagHandler::Main, "UDP DRAM heaps free %u\n", heap_caps_get_free_size(MALLOC_CAP_8BIT));
				startNetworking(false,
						 settingsFactory->getWebServerPort(),
						 settingsFactory->getUdpServerPort(),
						 settingsFactory->getHostname(),
						 settingsFactory->getFriendlyName());
			}
		}
		else
		{
			startConfigMode(
				settingsFactory->getWebServerPort(),
				settingsFactory->getUdpServerPort(),
				settingsFactory->getHostname(),
				settingsFactory->getFriendlyName());
		}
	}
#endif
	// otaHandler.setup();
	displayPrint("Setting up motor");
	motorHandler->setup();
    LogHandler::debug(TagHandler::Main, "Motor DRAM heaps free %u\n", heap_caps_get_free_size(MALLOC_CAP_8BIT));
	motionHandler.setup(settingsFactory->getTcodeVersion());
    LogHandler::debug(TagHandler::Main, "Motion handler DRAM heaps free %u\n", heap_caps_get_free_size(MALLOC_CAP_8BIT));
	loadI2CModules(displayEnabled, batteryLevelEnabled, voiceEnabled);
    LogHandler::debug(TagHandler::Main, "I2C DRAM heaps free %u\n", heap_caps_get_free_size(MALLOC_CAP_8BIT));

